controltheory/beamer/7/7_7_transient.tex
% Created 2013-11-02 Sat 16:29
\documentclass[table]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\usepackage[usenames]{color}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<article>{\usepackage{beamerarticle}}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{离散系统动态性能分析}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}













\mode<article>{连续系统:时域分析,根轨迹法,频域法,离散系统也有类似方法,这里只讨论时域响应}
\section{离散系统时间响应}
\label{sec-1}
\begin{frame}
\frametitle{离散系统时间响应计算}
\label{sec-1-1}

\begin{itemize}
\item 求  $\Phi(z)$  计算  $C(z)=\Phi(z)R(z)$ ,Z反变换求出  $C^*(t)$
\item 不存在  $\Phi(z)$  时,直接计算 $C(z)$  , Z反变换求出  $C^*(t)$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{离散系统时间响应计算示例:}
\label{sec-1-2}
%% 结构图
\label{sec-1-2-1}

\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
\path[->] (s1) edge node[midway] {$e^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of g1] (g2) {$\frac{K}{s(1+s)}$}; 
\path[->] (g1) edge node[midway] {$   $} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
\path[red] node[ inner sep=5pt,below =of g2] (h) {$   $}; 
\path[draw] (g2.east)+(1em,0) |- (h.west);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 

其中  $r(t)=1(t),T=1s$  求系统动态性能指标.
\begin{block}{解:}
\label{sec-1-2-2}


\begin{align*}
\only<2-3>{& G_o(z) = (1-z^{-1}){\cal Z}[\frac{1}{s^2+1}]  = \frac{0.368z+0.264}{(z-1)(z-0.368)} \\}
\only<3-4>{& \Phi(z)  = \frac{G_o(z)}{1+G_o(z)}  = \frac{0.368z+0.264}{z^2-z+0.632} \\}
\only<4-5>{& C(z) = \Phi(z)R(z)= \frac{0.368z^{-1}+0.264z^{-2}}{1-2z^{-1}+1.632z^{-2}-0.632z^{-3}} \\}
\only<5-6>{& C(z) = 0.368z^{-1}+z^{-2}+1.4z^{-3}+1.4z^{-4}1.147z^{-5}+0.895z^{-6}+0.802z^{-7}+0.868z^{-8}+\cdots \\}
\only<6-7>{& t_r=2s,t_p=4s,t_s=12s,\sigma\%=40\%}
\end{align*}
\end{block}
\end{frame}
\section{采样器,保持器对系统动态性能的影响}
\label{sec-2}
\begin{frame}
\frametitle{采样器,保持器对系统动态性能的影响}
\label{sec-2-1}

\begin{itemize}
\item 定性说明:
\begin{itemize}
\item 采样器: 使系统稳定性下降,使  $\sigma\%\uparrow,t_r\downarrow,t_s\downarrow$
\item <2->保持器: 使系统稳定性下降,使  $\sigma\%\uparrow,t_r\uparrow,t_s\uparrow$
\end{itemize}
\item <3->对大迟延系统,无上述定性结论
\end{itemize}
\end{frame}
\section{闭环极点与动态响应的关系}
\label{sec-3}
\begin{frame}
\frametitle{闭环极点与动态响应的关系}
\label{sec-3-1}

\begin{eqnarray*}
z & = & e^{sT}\\
 &=& e^{\sigma T}e^{j\omega T}
\end{eqnarray*}

\begin{itemize}
\item 若闭环极点  $|z|>1$  , 则有  $\sigma>0$  , 系统不稳定.
\item 若闭环极点  $|z|=1$  , 则有  $\sigma=0$  , 等幅振荡.
\item 若闭环极点  $|z|<1$  , 则有  $\sigma<0$  , 系统稳定.
\begin{itemize}
\item <2->闭环极点为正实数: 单调收敛
\item <2->闭环极点为负实数: 振荡收敛
\item <2->闭环极点为具有正实部的复数: 低频振荡收敛
\item <2->闭环极点为具有负实部的复数: 高频振荡收敛
\item <2->若  $|z|\rightarrow 0$  ,  $\sigma\rightarrow -\infty$ , 收敛极快
\item <3->系统期望的闭环极点在Z平面单位圆的右半圆内
\end{itemize}
\end{itemize}
\end{frame}

\end{document}
